{
  "teachers": [
    {
      "id": "1",
      "registration": "100293",
      "name": "Alecsandro Monteiro Kramer",
      "assessments": [
        {
          "Comportamental": {
            "Pontualidade": 3,
            "Assiduidade": 7,
            "Relacionamento": 7,
            "Motivação": 6
          },
          "Metodológico": {
            "Plano de Ensino": 7,
            "Plano de Aula": 6,
            "Metodologias Tradicionais": 8,
            "Metodologias Ativas": 5,
            "Linguagem": 6,
            "Avaliação de Aprendizagem": 5
          },
          "Pedagógico": {
            "Domínio": 8,
            "Clareza": 9,
            "Integração": 4,
            "Receptividade": 3,
            "Comprometimento": 10,
            "Participação dos Alunos": 2
          }
        },
        {
          "Comportamental": {
            "Pontualidade": 5,
            "Assiduidade": 6,
            "Relacionamento": 3,
            "Motivação": 8
          },
          "Metodológico": {
            "Plano de Ensino": 10,
            "Plano de Aula": 10,
            "Metodologias Tradicionais": 10,
            "Metodologias Ativas": 10,
            "Linguagem": 10,
            "Avaliação de Aprendizagem": 10
          },
          "Pedagógico": {
            "Domínio": 1,
            "Clareza": 1,
            "Integração": 1,
            "Receptividade": 1,
            "Comprometimento": 1,
            "Participação dos Alunos": 1
          }
        },
        {
          "Comportamental": {
            "Pontualidade": 6,
            "Assiduidade": 8,
            "Relacionamento": 7,
            "Motivação": 6
          },
          "Metodológico": {
            "Plano de Ensino": 9,
            "Plano de Aula": 5,
            "Metodologias Tradicionais": 6,
            "Metodologias Ativas": 7,
            "Linguagem": 5,
            "Avaliação de Aprendizagem": 2
          },
          "Pedagógico": {
            "Domínio": 10,
            "Clareza": 7,
            "Integração": 6,
            "Receptividade": 8,
            "Comprometimento": 6,
            "Participação dos Alunos": 5
          }
        },
        {
          "Comportamental": {
            "Pontualidade": 1,
            "Assiduidade": 2,
            "Relacionamento": 3,
            "Motivação": 4
          },
          "Metodológico": {
            "Plano de Ensino": 5,
            "Plano de Aula": 6,
            "Metodologias Tradicionais": 7,
            "Metodologias Ativas": 8,
            "Linguagem": 9,
            "Avaliação de Aprendizagem": 10
          },
          "Pedagógico": {
            "Domínio": 7,
            "Clareza": 6,
            "Integração": 5,
            "Receptividade": 3,
            "Comprometimento": 8,
            "Participação dos Alunos": 6
          }
        },
        {
          "Comportamental": {
            "Pontualidade": 2,
            "Assiduidade": 5,
            "Relacionamento": 7,
            "Motivação": 4
          },
          "Metodológico": {
            "Plano de Ensino": 6,
            "Plano de Aula": 8,
            "Metodologias Tradicionais": 2,
            "Metodologias Ativas": 9,
            "Linguagem": 10,
            "Avaliação de Aprendizagem": 6
          },
          "Pedagógico": {
            "Domínio": 5,
            "Clareza": 4,
            "Integração": 3,
            "Receptividade": 7,
            "Comprometimento": 6,
            "Participação dos Alunos": 9
          }
        },
        {
          "Comportamental": {
            "Pontualidade": 5,
            "Assiduidade": 10,
            "Relacionamento": 6,
            "Motivação": 3
          },
          "Metodológico": {
            "Plano de Ensino": 7,
            "Plano de Aula": 7,
            "Metodologias Tradicionais": 5,
            "Metodologias Ativas": 6,
            "Linguagem": 8,
            "Avaliação de Aprendizagem": 5
          },
          "Pedagógico": {
            "Domínio": 6,
            "Clareza": 7,
            "Integração": 8,
            "Receptividade": 9,
            "Comprometimento": 10,
            "Participação dos Alunos": 5
          }
        }
      ]
    },
    {
      "id": "2",
      "registration": "234566",
      "name": "Arthur Barôncio Lucena Kramer Neto",
      "assessments": [
        {
          "Organização e Planejamento": {
            "Planeja suas aulas com antecedência, apresentando planos de ensino e de aulas.": 2,
            "Apresenta antecipadamente as formas e os instrumentos de avaliação de aprendizagem.": 3,
            "Realiza síntese ao final das aulas e revisões antes dos momentos avaliativos.": 4,
            "Monitora o tempo, é pontual e organizado no gerenciamento do processo ensino-aprendizagem.": 3,
            "Termina a aula ofertando o conteúdo planejado, sem atrasar o início ou fim da aula.": 4,
            "Elabora explicações detalhadas e encontra o ritmo mais adequado para fazê-las, facilitando o entendimento.": 4
          },
          "Comunicação": {
            "Organiza as aulas, de forma que as tornem atraentes, transmitindo conteúdos em linguagem clara e compreensível.": 5,
            "Consegue utilizar múltiplas estratégias para explicar os conteúdos, mantendo a atenção dos estudantes e incentivando-os a participar, de forma que se mantenham atentos às aulas.": 4,
            "Expressa-se com desenvoltura e apresenta facilidade na tradução dos seus pensamentos em palavras, escolhendo palavras e forma de se comunicar para explicar diferentes conteúdos.": 4,
            "Promove debates dentro do processo formativo, de modo que auxiliem os estudantes na sua formatação de cidadãos, numa perspectiva de formação humana integral, para viver em sociedade e encarar os desafios do mundo do trabalho.": 4
          },
          "Interação Professor/Aluno": {
            "Dispensa tratamento cordial, ético e respeitoso aos estudantes, permitindo a interlocução, aceitando críticas, opiniões e sugestões que favoreçam à melhoria do ensino/aprendizagem.": 4,
            "Dispõe-se a recepcionar as necessidades dos estudantes, de maneira colaborativa e cooperativa, em sala de aula, na solução de dificuldades de aprendizagem com o componente curricular (disciplina), inclusive se colocando para atendê-los em suas particularidades de aprendizado e, se necessário, orientações extraclasse.": 3,
            "Demonstra paixão e empolgação por aprender, entender e explorar novas ideias, se interessando pelas perguntas e experiências dos estudantes.": 3,
            "Realiza suas atividades diárias com energia, entusiasmo e com atitudes positivas, se envolvendo com a atividade desempenhada, fazendo com que os estudantes se empolguem pela matéria.": 3,
            "Estabelece conexão com os estudantes, sentindo-se feliz e confortável com sua convivência e agindo de forma acolhedora e afetuosa.": 3
          },
          "Avaliação de Aprendizagem": {
            "Elabora e aplica as avaliações de aprendizagem compatíveis e coerentes com as discussões, debates e conteúdos desenvolvidos em sala de aula.": 3,
            "Realiza feedback com os estudantes para análise dos resultados das avaliações de aprendizagem em prol da melhoria do ensino-aprendizagem.": 3,
            "Efetua as avaliações de aprendizagem diversificadas, com perguntas e assertivas equilibradas no que tange ao grau de dificuldade, de modo que seja capaz de verificar o real aprendizado, baseando-se em critérios de avaliação claros.": 3
          },
          "Métodos e Materiais Didáticos": {
            "Adequa os conteúdos e explicações de forma a atingir a todos, bem como é capaz incorporar diferentes realidades socioculturais em seus materiais e em suas aulas.": 3,
            "Aplica exercícios de fixação/revisão, que relaciona teoria e prática e incentiva o desenvolvimento de atividades extraclasses.": 3,
            "Relaciona, à medida do possível, os conteúdos de seu componente curricular (disciplina) com a realidade socioeconômica do contexto social em que os estudantes estão inseridos e com o mundo do trabalho.": 3,
            "Articula conteúdos do seu componente curricular (disciplina) com outros da mesma área do conhecimento e de outras, a exemplo da formação geral e técnica.": 3,
            "Utiliza metodologias ativas como técnica pedagógica, oportunizando os estudantes de pensar e interagir com o material de estudo, como estratégia para promoção de uma educação transformadora, e colocando-os como protagonista da construção do próprio conhecimento.": 3
          },
          "Consciência Crítica": {
            "Realiza diálogo franco e aberto com os estudantes, convocando-os a participar do processo educativo, pautando os debates e as discussões na formação humana e integral, que formatem cidadãos críticos e reflexivos.": 4,
            "Promove uma educação orientada para a tomada de decisões, contextualizada nas condições sociais, culturais e econômicas dos estudantes.": 5,
            "Desenvolve sua prática docente conectando os conteúdos com as questões sociais e políticas do meio que estão inseridos, visando a responsabilidade social e política dos estudantes.": 4,
            "Adota a sala de aula como um espaço seguro e acolhedor para todos os estudantes, independentemente da sua orientação sexual ou identidade de gênero, contribuindo para a construção de um ambiente escolar mais tolerante e receptivo.": 5,
            "Promove a compreensão, o respeito e a empatia entre os estudantes, auxiliando a combater o preconceito e a discriminação em todas as suas formas.": 1,
            "Desenvolve e possibilita, em sua prática docente, posturas, saberes e fazeres inclusivos.": 2
          },
          "Autonomia": {
            "Encoraja, apoia e motiva os estudantes, fazendo-os acreditar que podem ter sucesso na escola e no mundo trabalho.": 3,
            "Desenvolve nos estudantes a crença de que são capazes de atingir um bom desempenho.": 4,
            "Preocupa-se com aqueles estudantes que possuem algum grau de dificuldade, oferecendo-lhes especial atenção.": 3,
            "Utiliza estratégias que incentivam os estudantes na aprendizagem, de forma autônoma e participativa, por meio de problemas e situações reais, realizando tarefas que os levem a pensar, criar e debater, tornando-os protagonistas pela construção de conhecimento.": 4
          }
        }
      ]
    },
    {
      "id": "3",
      "registration": "988032",
      "name": "Dilene Barreto de Oliveira",
      "assessments": [
        {
          "Comportamental": {
            "Pontualidade": 10,
            "Assiduidade": 10,
            "Relacionamento": 10,
            "Motivação": 10
          },
          "Metodológico": {
            "Plano de Ensino": 10,
            "Plano de Aula": 10,
            "Metodologias Tradicionais": 10,
            "Metodologias Ativas": 10,
            "Linguagem": 10,
            "Avaliação de Aprendizagem": 10
          },
          "Pedagógico": {
            "Domínio": 10,
            "Clareza": 10,
            "Integração": 10,
            "Receptividade": 10,
            "Comprometimento": 10,
            "Participação dos Alunos": 10
          }
        }
      ]
    }
  ]
}