[
  {
    "dimension": "Organização e Planejamento",
    "color": "#3688A3",
    "sentences": [
      "Planeja suas aulas com antecedência, apresentando planos de ensino e de aulas.",
      "Apresenta antecipadamente as formas e os instrumentos de avaliação de aprendizagem.",
      "Realiza revisões de conteúdos antes dos momentos avaliativos.",
      "Monitora o tempo de aula, é pontual e organizado na condução do componente curricular (disciplina).",
      "Termina a aula ofertando o conteúdo planejado, sem atrasar o início ou fim da aula.",
      "Elabora explicações detalhadas, no ritmo adequado, que facilitam o entendimento."
    ]
  },
  {
    "dimension": "Comunicação",
    "color": "#BE62E3",
    "sentences": [
      "Organiza as aulas, de forma que as tornem atraentes, dialogando em linguagem clara e compreensível.",
      "Consegue utilizar múltiplas estratégias para explicar os conteúdos, mantendo a atenção dos estudantes e incentivando-os a participar, de forma que se mantenham atentos às aulas.",
      "Expressa-se com desenvoltura e apresenta facilidade na tradução dos seus pensamentos em palavras, escolhendo termos e forma de se comunicar para explicar diferentes conteúdos.",
      "Promove debates dentro do processo formativo, de modo que auxiliem os estudantes na sua formatação de cidadãos, numa perspectiva de formação humana integral."
    ]
  },
  {
    "dimension": "Interação Professor/Aluno",
    "color": "#8E880D",
    "sentences": [
      "Utiliza-se de tratamento cordial, ético e respeitoso aos estudantes, de modo que permita a interlocução, aceitando críticas, opiniões e sugestões que favoreçam a melhoria do ensino/aprendizagem.",
      "Dispõe-se, em sala de aula, a recepcionar as necessidades dos estudantes, de maneira colaborativa e cooperativa na solução de dificuldades de aprendizagem com o componente curricular (disciplina).",
      "Demonstra interesse e dedicação por aprender, entender e explorar novas ideias, preocupando-se com as perguntas e experiências dos estudantes.",
      "Realiza suas atividades diárias com aplicação e atitudes positivas, envolvendo-se na atividade desempenhada, fazendo com que os estudantes se empolguem pela matéria.",
      "Estabelece conexão com os estudantes, sentindo-se feliz e confortável com sua convivência e agindo de forma acolhedora e afetuosa."
    ]
  },
  {
    "dimension": "Avaliação de Aprendizagem",
    "color": "#C4287C",
    "sentences": [
      "Elabora e aplica as avaliações de aprendizagem compatíveis e coerentes com as discussões, debates e conteúdos desenvolvidos em sala de aula.",
      "Realiza feedback com os estudantes para análise dos resultados das avaliações de aprendizagem em prol da melhoria do ensino-aprendizagem.",
      "Realiza avaliações de aprendizagem diversificadas, variando perguntas e assertivas em função do grau de dificuldade."
    ]
  },
  {
    "dimension": "Métodos e Materiais Didáticos",
    "color": "#0500FF",
    "sentences": [
      "Adequa os conteúdos e explicações de forma a atingir a todos, bem como é capaz incorporar diferentes realidades socioculturais em seus materiais e em suas aulas.",
      "Aplica exercícios de fixação/revisão, relacionando teoria e prática, e incentiva o desenvolvimento de atividades extraclasses.",
      "Relaciona, à medida do possível, os conteúdos de seu componente curricular (disciplina) com a realidade socioeconômica do contexto social em que os estudantes estão inseridos e com o mundo do trabalho.",
      "Articula conteúdos do seu componente curricular (disciplina) com outros da mesma área do conhecimento e de outras áreas, a exemplo da formação geral e técnica.",
      "Utiliza metodologias ativas como técnica pedagógica, oferecendo aos estudantes a oportunidade de pensar e interagir com o material de estudo, como estratégia para promoção de uma educação transformadora, e colocando-os como protagonistas da construção do próprio conhecimento. (Ex: Sala de Aula Invertida, Gamificação, Ensino Híbrido, Seminário, Estudo de caso, dentre outros)"
      ]
    },
    {
      "dimension": "Consciência Crítica",
      "color": "#FF9900",
      "sentences": [
        "Realiza diálogo franco e aberto com os estudantes, convocando-os a participar do processo educativo, pautando os debates e as discussões na formação humana e integral, que formatem cidadãos críticos e reflexivos.",
        "Desenvolve sua prática docente conectando os conteúdos com as questões sociais, culturais e econômicas do meio em que os estudantes estão inseridos, para que sejam cidadãos ativos, conscientes e engajados na sociedade.",
        "Adota a sala de aula como um espaço seguro e acolhedor para todos os estudantes, independentemente da sua orientação sexual ou identidade de gênero, contribuindo para a construção de um ambiente escolar mais tolerante e receptivo.",
        "Promove a compreensão, o respeito e a empatia entre os estudantes, auxiliando a combater o preconceito e a discriminação em todas as suas formas.",
        "Desenvolve e possibilita, em sua prática docente, posturas, saberes e fazeres inclusivos."
      ]
    },
    {
      "dimension": "Autonomia",
      "color": "#331757",
      "sentences": [
        "Encoraja, apoia e motiva os estudantes, fazendo-os acreditar que podem ter sucesso na escola e no mundo trabalho.",
        "Preocupa-se com aqueles estudantes que possuem algum grau de dificuldade, oferecendo-lhes especial atenção.",
        "Utiliza de estratégias que incentivam os estudantes na aprendizagem, de forma autônoma e participativa, por meio de problemas e situações reais, realizando tarefas que os levem ao raciocínio, à criação e ao debate, tornando-os protagonistas pela construção de conhecimento."
      ]
    }
  ]
